[
    {
        "text": "Idiot ginger and mouse violate 8 health code regulations.", 
        "answer": "Ratatouille"
    },
    {
        "text": "Older sister ruins younger sister's chance to be on nationally televised game show.",
        "answer": "The Hunger Games"
    },
    {
        "text": "Woman abandons all her standards to win back a horny teenager with greasy hair.",
        "answer": "Grease"
    },
    {
        "text": "Drunk guy keeps losing his transportation.",
        "answer": "Pirates of the Caribbean"
    },
    {
        "text": "Story of a boy so annoying his parents abandon him every Xmas hoping somebody will kill him.",
        "answer": "Home Alone"
    },
    {
        "text": "A young man forcibly binds other men and photographs them for money.",
        "answer": "Spider Man"
    },
    {
        "text": "A series of naps.",
        "answer": "Inception"
    },
    {
        "text": "Miserable billionaire terrorizes mentally ill man.",
        "answer": "The Dark Knight"
    },
    {
        "text": "A love triangle between an eighteen-year-old girl, a hundred-year-old guy and a dog.",
        "answer": "Twilight"
    },
    {
        "text": "Girl has to pretend she's a man to be taken seriously.",
        "answer": "Mulan"
    },
    {
        "text": "11-year-old kills his teacher just to get stoned.",
        "answer": "Harry Potter and the Sorcerer’s Stone"
    },
    {
        "text": "An elderly man abducts a young overweight Asian boy to replace his dead wife.",
        "answer": "Up"
    },
    {
        "text": "A pretty, bookish girl becomes an outcast in her own town when she realizes she's a furry.",
        "answer": "Beauty and the Beast"
    },
    {
        "text": "Talking frog convinces son to kill his dad.",
        "answer": "Star Wars"
    },
    {
        "text": "American invades foreign land, kills local leadership, struggles to find exit strategy.",
        "answer": "The Wizard of Oz"
    },
    {
        "text": "Immigrant adoptee is repatriated to country of birth, experiences culture shock & prejudice.",
        "answer": "Elf"
    },
    {
        "text": "She started wearing less and going out more.",
        "answer": "Mean Girls"
    },
    {
        "text": "A film about how true love conquers the fear of getting syphilis.",
        "answer": "Pretty Woman"
    }
]